MAIN_MENU, CHOICE, CREATING_POST, CREATING_CHOICE, PHOTO_ADD, TEXT_ADD, KEYBOARD_ADD = range(7)

HELLO_MESSAGE = 'Привет, я пост-бот, я помогу тебе сделать крутые посты с кнопочками и другими штуками)'
MAIN_MENU_TEXT = 'Создадим пост?'
CREATING_POST_TEXT = 'Что вы хотите добавить в свой пост?'
PHOTO_ADDING_TEXT = 'Пришлите мне фото (не файл)...'
TEXT_ADDING_TEXT = 'Пришлите мне текст для поста, который вы хотели бы добавить...'

KEYBOARD_ADD_TEXT = '''​Отправьте ссылку(и) в формате:
[Текст кнопки + ссылка]
Пример:
[Переводчик + https://translate.google.com]

Чтобы добавить несколько кнопок в один ряд, пишите ссылки рядом с предыдущими.
Формат:
[Первый текст + первая ссылка] | [Второй текст + вторая ссылка]

Чтобы добавить несколько кнопок в строчку, пишите новые ссылки с новой строки.
Формат:
[Первый текст + первая ссылка]
[Второй текст + вторая ссылка]'''

BYE_TEXT = "Надеюсь, что я вам чем-то помог!"